#### Terraform Format and Style 🖌
#### Environment staging (CD)
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
confluent_environment.staging: Refreshing state... [id=env-1j7znz]
confluent_service_account.platform-manager: Refreshing state... [id=sa-g1j58r]
confluent_kafka_cluster.standard: Refreshing state... [id=lkc-19y2w6]
confluent_role_binding.platform-manager-kafka-cluster-admin: Refreshing state... [id=rb-lMm4y]
confluent_api_key.platform-manager-kafka-api-key: Refreshing state... [id=ICAZYY3LYBMGNG2N]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # confluent_api_key.platform-manager-kafka-api-key must be replaced
-/+ resource "confluent_api_key" "platform-manager-kafka-api-key" {
      ~ id                     = "ICAZYY3LYBMGNG2N" -> (known after apply)
      ~ secret                 = (sensitive value)
        # (3 unchanged attributes hidden)

      ~ managed_resource {
          ~ api_version = "cmk/v2" # forces replacement -> (known after apply) # forces replacement
          ~ id          = "lkc-19y2w6" # forces replacement -> (known after apply) # forces replacement
          ~ kind        = "Cluster" # forces replacement -> (known after apply) # forces replacement

          ~ environment {
              ~ id = "env-1j7znz" # forces replacement -> (known after apply) # forces replacement
            }
        }

        # (1 unchanged block hidden)
    }

  # confluent_environment.env will be created
  + resource "confluent_environment" "env" {
      + display_name  = "staging"
      + id            = (known after apply)
      + resource_name = (known after apply)
    }

  # confluent_environment.staging will be destroyed
  # (because confluent_environment.staging is not in configuration)
  - resource "confluent_environment" "staging" {
      - display_name  = "Staging" -> null
      - id            = "env-1j7znz" -> null
      - resource_name = "crn://confluent.cloud/organization=6c45aedc-ad4c-4ae8-983b-87af5b96ba62/environment=env-1j7znz" -> null
    }

  # confluent_kafka_cluster.standard must be replaced
-/+ resource "confluent_kafka_cluster" "standard" {
      ~ api_version        = "cmk/v2" -> (known after apply)
      ~ bootstrap_endpoint = "SASL_SSL://pkc-ymrq7.us-east-2.aws.confluent.cloud:9092" -> (known after apply)
      ~ id                 = "lkc-19y2w6" -> (known after apply)
      ~ kind               = "Cluster" -> (known after apply)
      ~ rbac_crn           = "crn://confluent.cloud/organization=6c45aedc-ad4c-4ae8-983b-87af5b96ba62/environment=env-1j7znz/cloud-cluster=lkc-19y2w6" -> (known after apply)
      ~ rest_endpoint      = "https://pkc-ymrq7.us-east-2.aws.confluent.cloud:443" -> (known after apply)
        # (4 unchanged attributes hidden)

      - byok_key {}

      ~ environment {
          ~ id = "env-1j7znz" # forces replacement -> (known after apply) # forces replacement
        }

      - network {}

        # (1 unchanged block hidden)
    }

  # confluent_role_binding.platform-manager-kafka-cluster-admin must be replaced
-/+ resource "confluent_role_binding" "platform-manager-kafka-cluster-admin" {
      ~ crn_pattern = "crn://confluent.cloud/organization=6c45aedc-ad4c-4ae8-983b-87af5b96ba62/environment=env-1j7znz/cloud-cluster=lkc-19y2w6" # forces replacement -> (known after apply) # forces replacement
      ~ id          = "rb-lMm4y" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

```

</details>
*Pushed by: @gphilipp, Action: `pull_request`*